//==============================================================================
//                      MyDefine.h
//                       
//begin   : 2016-09-10                                                 
//describe:                                              
//==============================================================================
#ifndef SELFDEF_MYDEFINE_H 
#define SELFDEF_MYDEFINE_H

//==============================================================================
//							日志相关宏定义
//==============================================================================
// 日志相关大小相关
#define BIG_LOG_SIZE			5*1024*1024		// 3M大小（需要记录的信息多的文件）
#define BIG_LOG_ROLL			5				// 3个文件（需要记录的信息多的文件）
#define SMALL_LOG_SIZE			2*1024*1024		// 1M大小（需要记录的信息少的文件）
#define SMALL_LOG_ROLL			3				// 3个文件（需要记录的信息少的文件）

// 日志名相关


//==============================================================================
//							其他常用的宏定义
//==============================================================================
#define CONF_PRIVATE_FILE_NAME	"CommInner.xml"	// 程序私有配置的文件名

// 服务端、客户端的select超时时间，单位ms
#define SELECT_TIMEOUT_COMMINNER			5

// CommInner所连接客户端状态信息发送时间间隔， 单位s
#define TIMER_COMMSTATE_INTERVAL            1

// 状态采集服务客户端ID
#define RMINTERSYS_CLIENT_ID                195

// A机标识
#define HOST_A_FLAG                          0x61


#endif
